import { Question } from '../types/quiz';

export const imageQuestions: Question[] = [
  {
    id: 1,
    title: "١. لەم وێنەیەدا ئۆتۆمبێلەکە بۆی هەیە ماتۆڕەکە تێپەڕێنێت",
    image: "https://i.postimg.cc/6qyLV95m/1.png",
    options: [
      "بەڵێ لەبەر بوونی هێڵەکی سپی پڕ پڕ لە لای چەپی ئۆتۆمبێلەکە",
      "نەخێر",
      "نەخێر لەبەر بوونی هێڵەکی سپی پڕ پڕ و یەکترێری بەردەوام لە لای چەپی ئۆتۆمبێلەکە"
    ],
    correctAnswer: 0
  },
  {
    id: 2,
    title: "٢. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/HLYZN8YJ/2.png",
    options: [
      "ئاگادارە لە مەترسی کەوتن",
      "ئاگادارە لە هەڵخلیسکان",
      "ئاگادارە لە بوونی تاسەی دەستکرد"
    ],
    correctAnswer: 1
  },
  {
    id: 3,
    title: "٣. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/P5xvFtGX/3.png",
    options: [
      "ئاگادارە ترافیک لە پێشە",
      "ئاگادارە شوێنی پەڕینەوەی پیادەت لە پێشە",
      "ئاگادارە پێشینەی بۆ ڕێگای سەرەکیە دوو ڕێگای لاوەکی لێدەبێتەوە بۆ لای ڕاست و بۆ لای چەپ"
    ],
    correctAnswer: 2
  },
  {
    id: 4,
    title: "٤. هۆکارەکەی چیە ئۆتۆمبێلە شینەکە ناتوانێت لەئۆتۆمبێلە سەوزەکەی پێشی تێپەڕێت",
    image: "https://i.postimg.cc/Njz93WY1/4.png",
    options: [
      "بونی هێڵی نەبڕاو لە دیوی لای چەپی ئۆتۆمبێلە ڕەنگ شینەکە",
      "بوونی ئۆتۆمبێلێکی دیکە لە دیوی لای چەپی ئۆتۆمبێلە ڕەنگ شینەکە",
      "ئۆتۆمبێلە ڕەنگ شینەکە بۆی هەیە تێپەڕێت"
    ],
    correctAnswer: 0
  },
  {
    id: 5,
    title: "٥. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/x13YHmpq/5.png",
    options: [
      "ئاگادارە لە پێشەوە لقێک هەیە بۆ لای چەپ",
      "ئاگادارە لە پێشەوە لقێک هەیە بۆ لای ڕاست",
      "ئاگادارە پێچ کردنەوە هەیە بۆ لای چەپ"
    ],
    correctAnswer: 0
  },
  {
    id: 6,
    title: "٦. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/m2MTLJQY/6.png",
    options: [
      "هاتنە ژوورەوە قەدەغەیە",
      "بوەستە ڕێگا بە پێشینەی هاتووچۆ بدە",
      "ڕێگای سەرەکی پێشینەی هاتووچۆ (پێشینە بۆتۆیە)"
    ],
    correctAnswer: 1
  },
  {
    id: 7,
    title: "٧. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/SxhkJdrw/7.png",
    options: [
      "ڕێگاکە داخراوە",
      "تەنها دەتوانی بەم دوو ئاڕاستەیە بڕۆیت",
      "پێچ کردنەوەی ڕاست و چەپ"
    ],
    correctAnswer: 1
  },
  {
    id: 8,
    title: "٨. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/8CkGbCx4/8.png",
    options: [
      "ئاگاداری قۆڵتی بەرزە",
      "ئاگاری هەڵخلیسکانی ڕێگا بە",
      "ئاگاداری مەترسی جۆراو جۆر بە"
    ],
    correctAnswer: 2
  },
  {
    id: 9,
    title: "٩. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/GpT8dqh6/9.png",
    options: [
      "بە ئاڕاستەی میلی کاتژمێر بڕۆ",
      "بەرەو پێشەوە بڕۆ",
      "دەچیتە گۆڕەپان بە ئاڕاستەی هێماکە بڕۆ بۆ سووڕانەوە"
    ],
    correctAnswer: 2
  },
  {
    id: 10,
    title: "١٠. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/QxjT1Q0W/10.png",
    options: [
      "ئاگادارە ڕێگاکە تەسک دەبێتەوە لە لای چەپ",
      "ئاگادارە ڕێگاکە تەسک دەبێتەوە لە ڕاست",
      "ئاگادارە ڕێگاکە تەسک دەبێتەوە لە هەردووڵا"
    ],
    correctAnswer: 1
  },
  {
    id: 11,
    title: "١١. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/9F1qpDng/11.png",
    options: [
      "ئاگادارە ڕێگاکە تەسک دەبێتەوە لە لای چەپ",
      "ئاگادارە ڕێگاکە تەسک دەبێتەوە لە ڕاست",
      "ئاگادارە ڕێگاکە تەسک دەبێتەوە لە هەردووڵا"
    ],
    correctAnswer: 2
  },
  {
    id: 12,
    title: "١٢. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/Xv2b1bbb/12.png",
    options: [
      "ئاگادارە لە پێشت تونێل هەیە",
      "چوونە ژوورەوە قەدەغەیە",
      "ئاگادارە لە تاشە بەردی کەوتوو"
    ],
    correctAnswer: 0
  },
  {
    id: 13,
    title: "١٣. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/FR7Q2BrJ/13.png",
    options: [
      "ئاگادارە هێڵی شەمەندەفەرت لەپێشە",
      "ئاگادارە بە درێژایی ١٠٠م",
      "ئاگادارە بە درێژایی ٢٠٠م"
    ],
    correctAnswer: 2
  },
  {
    id: 14,
    title: "١٤. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/W3CPjwzY/14.png",
    options: [
      "ئاگادارە دووریەکی گونجاو بە جێبهێڵە لە نێوان ئۆتۆمبێلەکەت و ئۆتۆمبێلی پێش خۆت",
      "پێشینەی هاتووچۆ بۆتۆیە",
      "مانۆڕی تێپەڕاندن قەدەغەیە"
    ],
    correctAnswer: 2
  },
  {
    id: 15,
    title: "١٥. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/4ycR3Hhf/15.png",
    options: [
      "کۆتایی قەدەغەبوونی مانۆڕی تێپەڕاندن لە گشت جۆری ئۆتۆمبێلەکان",
      "کۆتایی قەدەغەبوونی مانۆڕی تێپەڕاندن لە ئۆتۆمبێلی بچووک",
      "تێپەڕاندن قەدەغەیە"
    ],
    correctAnswer: 0
  },
  {
    id: 16,
    title: "١٦. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/nV9J2gSy/16.png",
    options: [
      "مانۆڕی تێپەڕاندن قەدەغەیە بۆ بارهەڵگرەکان",
      "کۆتایی قەدەغەی تێپەڕاندن بۆ بارهەڵگرەکان",
      "هاتووچۆکردنی بارهەڵگر بەم ڕێگەیەدا قەدەغەیە"
    ],
    correctAnswer: 0
  },
  {
    id: 17,
    title: "١٧. ئەم هێمایە مانای چیە",
    image: "https://i.postimg.cc/MKk8F5hv/17.png",
    options: [
      "مانۆڕی تێپەڕاندن قەدەغەیە بۆ بارهەڵگرەکان",
      "کۆتایی قەدەغەی تێپەڕاندن بۆ بارهەڵگرەکان",
      "کۆتایی قەدەغەی تێپەڕاندن بۆ سەرجەم ئۆتۆمبێلەکان"
    ],
    correctAnswer: 1
  },
  {
    id: 18,
    title: "١٨. ئەم هێمایە مانای چیە",
    image: "https://i.postimg.cc/8PhVQWSw/18.png",
    options: [
      "ڕێگای خێرا",
      "کۆتایی ڕێگای خێرا",
      "ڕێگای داخراو"
    ],
    correctAnswer: 0
  },
  {
    id: 19,
    title: "١٩. مەودای دروست چەندە بۆ وەستانی ئۆتۆمبێل لە نزیک هێڵی پەڕینەوەی پیادە",
    image: "https://i.postimg.cc/rwM28myT/19.png",
    options: [
      "بیست مەتر پێش و دە مەتر دوای هێڵی پەڕینەوەی پیادە",
      "مەودا گرنگ نیەگرنگ ئەوەیە لەسەر هێڵ نەوەستیت",
      "پێنج مەتر پێش و پێنج مەتر دوای هێڵی پەڕینەوە"
    ],
    correctAnswer: 0
  },
  {
    id: 20,
    title: "٢٠. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/kgs3DmDb/20.png",
    options: [
      "ڕێگایەکی داخراو",
      "ڕێگای خێرا",
      "کۆتایی ڕێگای خێرا"
    ],
    correctAnswer: 2
  },
  {
    id: 21,
    title: "٢١. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/ZqqkdMyD/21.png",
    options: [
      "هاتووچۆکردن قەدەغەیە بەهەردوو ئاڕاستە",
      "خاڵی پشکنین هەیە بوەستە",
      "وەستان قەدەغەیە"
    ],
    correctAnswer: 0
  },
  {
    id: 22,
    title: "٢٢. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/FKCMgVyF/22.png",
    options: [
      "ڕێگایەکی یەک ئاڕاستە",
      "ڕێگایەکە داخراوە",
      "کۆتایی ڕێگای خێرا"
    ],
    correctAnswer: 1
  },
  {
    id: 23,
    title: "٢٣. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/KzKd93fP/23.png",
    options: [
      "وەستان زیاتر لە ٥ خولەک قەدەغەیە",
      "وەستان و چاوەڕێکردن قەدەغەیە",
      "هاتنە ناوەوە قەدەغەیە"
    ],
    correctAnswer: 1
  },
  {
    id: 24,
    title: "٢٤. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/MThggZ3h/24.png",
    options: [
      "ڕێگای سەرەکی پێشینەی هاتووچۆ(پێشینە بۆتۆ نیە)",
      "کۆتایی ڕێگای پێشینەی هاتووچۆ(کۆتایی پێشینە)",
      "ڕێگای سەرەکی پێشینەی هاتووچۆ(پێشینە بۆتۆیە)"
    ],
    correctAnswer: 2
  },
  {
    id: 25,
    title: "٢٥. ئەم هێمایە چی دەگەیەنێت",
    image: "https://i.postimg.cc/WzgxVRQt/25.png",
    options: [
      "ئاگادارە لە پێشەوە ڕێگایەکی لاوەکی هەیە بۆ لای چەپ",
      "ئاگادارە چەند پێچێک هەیە یەکەمیان بۆ لای چەپە",
      "ئاگادارە لەپێشت پێچکردنەوە هەیە بۆلای چەپ"
    ],
    correctAnswer: 2
  }
];