import { Question } from '../types/quiz';

export const questions: Question[] = [
  {
    id: 1,
    title: "١. یاسای هاتوچۆ بۆ کێیە؟",
    options: ["تەنها بۆ شۆفێرە", "بۆ شۆفێر و پیادەیە", "بۆ شۆفێر و سەرنشین و پیادەیە"],
    correctAnswer: 2
  },
  {
    id: 2,
    title: "٢. ڕێگە پێدراوە سەرنشین بەشێکی جەستەی لە ئۆتۆمبێلەوە بهێنەتە دەر؟",
    options: ["بەڵێ کاتێک گەرمە بێت", "نەخێر هیچ کات ڕێگەپێدراو نییە", "بەڵێ لە هەندێک کاتدا دەتوانێت"],
    correctAnswer: 1
  },
  {
    id: 3,
    title: "٣. ئایا مۆڵەتی شۆفێری پوچەڵ دەبێتەوە؟",
    options: ["بەڵێ، ئەگەر شۆفێر یەکێک لەمەرجەکانی بەدەستهێنانی مۆڵەتی لەدەست دابێت", "نەخێر هەرگیز پوچەڵ نابێتەوە", "بەڵێ ئەگەر سەرپێچیەک بکات"],
    correctAnswer: 0
  },
  {
    id: 4,
    title: "٤. هەر کەسێک بەبێ مۆڵەت شۆفێری بکات بۆ یەکەم جار سزا دەدرێت بە:",
    options: ["بەندکردن", "سزای دارایی", "بەندکردن و پێبژاردن"],
    correctAnswer: 1
  },
  {
    id: 5,
    title: "٥. هەر کەسێک بۆ دووەم جار بەبێ مۆڵەت شۆفێری بکات سزا دەدرێت بە:",
    options: ["بەندکردن", "سزای دارایی", "بەندکردن و پێبژاردن"],
    correctAnswer: 2
  },
  {
    id: 6,
    title: "٦. سزای ئەو کەسە چییە ئۆتۆمبێلەکەی بداتە دەست کەسێک کە مۆڵەتی شۆفێری نەبێت:",
    options: ["هەمان سزای شۆفێرە بێ مۆڵەتەکەی هەیە", "تەنها شۆفێرەکە سزا دەدرێت", "مۆڵەتەکەی لێوەردەگیرێتەوە"],
    correctAnswer: 0
  },
  {
    id: 7,
    title: "٧. ئەگەر کەسێک بەسەرخۆشی لێبخوڕێت سزا دەدرێت:",
    options: ["بە بەندکردن یان سزای دارایی و لێسەندنەوەی مۆڵەتەکەی", "بەندکردن", "سزای دارایی"],
    correctAnswer: 0
  },
  {
    id: 8,
    title: "٨. ئەگەر کەسێک لەژێر کاریگەری مادەی هۆشبەر ئۆتۆمبێل لێبخوڕێت سزا دەدرێت:",
    options: ["بە بەندکردن یان سزای دارایی و لێسەندنەوەی مۆڵەتەکەی", "بەندکردن", "سزای دارایی"],
    correctAnswer: 0
  },
  {
    id: 9,
    title: "٩. ڕێگای دەرەکی چییە؟",
    options: ["ئەو ڕێگایانەن کە شارەکان پێکەوە دەبەستنەوە", "ئەو ڕێگایانەن گوندەکان بەیەکەوە دەبەستێتەوە", "ئەو ڕێگایانەن کە گەرەکەکان بەیەکەوە دەبەستێتەوە"],
    correctAnswer: 0
  },
  {
    id: 10,
    title: "١٠. ڕێگای ناوخۆیی چییە؟",
    options: ["لە ڕێگای سەرەکی پێکهاتووە", "لە ڕێگای لاوەکی پێک هاتووە", "لەڕێگای سەرەکی و لاوەکی پێکهاتووە"],
    correctAnswer: 2
  },
  {
    id: 11,
    title: "١١. ڕێڕەوی فریاکەوتن؟",
    options: ["دەکەوێتە دەستە ڕاستی ڕێگاوە", "دەکەوێتە دەستە ڕاست و چەپی ڕێگاوە", "دەکەوێتە دەستە چەپی ڕێگاوە"],
    correctAnswer: 1
  },
  {
    id: 12,
    title: "١٢. ڕێڕەوی ناوەڕاست بۆ چییە؟",
    options: ["تایبەت کراوە بە لێخوڕینی ڕاستەو ڕاست", "تایبەت کراوە بەو لێخوڕانەی لادەدەن", "تایبەت کراوە بەو لێخوڕانەی سوڕانەوە ئەنجام دەدەن"],
    correctAnswer: 0
  },
  {
    id: 13,
    title: "١٣. تیری ئاڕاستەکردنی ڕێڕەو چییە؟",
    options: ["فەرمان بە گەڕانەوەی سوارۆکان دەکات", "فەرمان بە ئاڕاستەکردنی سوارڕۆکان دەکات", "فەرمان بە وەستانی سوارۆکان دەکات"],
    correctAnswer: 1
  },
  {
    id: 14,
    title: "١٤. لە چ شوێنێک لێخوڕینی ئۆتۆمبێل بە عەرەبانەوە مەترسیدارە؟",
    options: ["لە هەورازەکاندا", "لە تەختاییدا", "لە هەوراز، نشێو، پێچ"],
    correctAnswer: 2
  },
  {
    id: 15,
    title: "١٥. لە کاتی بەستنی عەرەبانە بە ئۆتۆمبێل پێویستە کێشی عەرەبانە چۆن بێت؟",
    options: ["دەبێت کێشی عەرەبانەکە لە ئۆتۆمبێلەکە زیاتر بێت", "نابێت کێشی عەرەبانە لە ئۆتۆمبێلەکە زیاتر بێت", "دەبێت کێشی عەرەبانەکە یەکسان بێت بە کێشی ئۆتۆمبێلەکە"],
    correctAnswer: 1
  },
  {
    id: 16,
    title: "١٦. ئەگەر گومانت کرد کەسێک دوای ڕووداوی هاتوچۆ زیان بەر بڕبڕەی پشتی کەوتبێت، پێویستە چی بکەیت؟",
    options: ["هەوڵدەدەم کەسەکە بخەمە سەر جێگایەکی نەرم", "هەوڵدەدەم کەسەکە بخەمە سەر ڕەق", "هەوڵدەدەم کەسەکە نەجوڵێت بەتایبەتی لە سەر وملی دا"],
    correctAnswer: 2
  },
  {
    id: 17,
    title: "١٧. چی دەکەیت ئەگەر توشی خوێنبەربونی لووت بویت لەکاتی لێخوڕینی ئۆتۆمبێلدا؟",
    options: ["بە پەنجە کونەکانی لووت بەیەکەوە دەنوشتێنمەوە و سەربۆ پێشەوە لار دەکەمەوە", "بە پەنجە کونەکانی لووت بەیەکەوە دەنوشتێنمەوە و سەر بۆ سەرەوە بەرز دەکەمەوە", "بە پەنجە کونەکانی لووت بەیەکەوە دەنوشتێنمەوە، سەر ڕێک ڕادەگرم"],
    correctAnswer: 0
  },
  {
    id: 18,
    title: "١٨. چی دەکەیت ئەگەر قوربانیەک لە ناو ئۆتۆمبێلەکەیدا گیری خواردبوو دوای ڕووداوی هاتوچۆ؟",
    options: ["هەوڵدەدەم دەرگاکان بکەمەوە", "هەوڵدەدەم جامەکان بشکێنم", "هەوڵدەدەم بەهێمنی بمێنێتەوە و چاوەڕی دەکەم بۆ گەیشتنی تیمی فریاگوزاری"],
    correctAnswer: 2
  },
  {
    id: 19,
    title: "١٩. چۆن هاوکاری کەسێک دەکەیت کە بەهۆی ڕووداوێکەوە شتێکی دەرەکی کەوتبێتە ناو چاویەوە؟",
    options: ["شتەکە بەدەست دەردێنم", "بە وریایی بە ئاوی پاک چاوی دەشۆم", "یەکسەر چاوی دەبەستم"],
    correctAnswer: 1
  },
  {
    id: 20,
    title: "٢٠. هەر کەسێک سوکایەتی بکات بە پۆلیسی هاتوچۆ سزا دەدرێت:",
    options: ["بەندکردن", "سزای دارایی", "بەندکردن و پێبژاردن"],
    correctAnswer: 0
  },
  {
    id: 21,
    title: "٢١. هەر کەسێک هەڕەشە لە پۆلیسی هاتوچۆ بکات سزا دەدرێت:",
    options: ["بە بەندکردن", "سزای دارایی", "بەندکردن و پێبژاردن"],
    correctAnswer: 0
  },
  {
    id: 22,
    title: "٢٢. خۆت ئامادەکردووە بۆ گەشتێکی دوور و درێژ. ئایا پێویستە کاتێک بۆ پشووەدان دابنێیت؟",
    options: ["لە کۆتایی گەشتەکە پشووەدەدەم", "بەڵێ، پێویستە", "نەخێر پێویست ناکات"],
    correctAnswer: 1
  },
  {
    id: 23,
    title: "٢٣. دەرمان وای لێکردووی خەواڵووبیت، لەم کاتەدا پێویستە چی بکرێت؟",
    options: ["هەوڵدەدەم بە هێواشی لێبخوڕم", "دەم وچاوم دەشۆم و دەست دەکەم بە لێخوڕین", "لێناخوڕم تەکسی بەکار دەهێنم"],
    correctAnswer: 2
  },
  {
    id: 24,
    title: "٢٤. چی دەبێتە هۆی کەمکردنەوەی مەترسی برینداربوونی مل لە کاتی ڕووداوی هاتوچۆدا؟",
    options: ["کوشن ئەگەر بەباشی ڕێکخرابێ", "کەللەی کوشن ئەگەر بەباشی ڕێکخرابێ", "پشتێنی سەلامەتی"],
    correctAnswer: 1
  },
  {
    id: 25,
    title: "٢٥. ئەگەر قوربانییەکی ڕووداوی هاتوچۆ لە هۆش خۆیدا بێت بەڵام باس لە ئازاری سنگی وسەختی هەناسەدانی بکات، ئەمە دەکرێت ئاماژە بە چی بکات؟",
    options: ["جەڵتەی دڵ", "کێشە لە سیەکانی", "پەراستووەکانی شکابن"],
    correctAnswer: 0
  }
];